---
kind: other
id: Methods.T:Autodesk.Revit.DB.RenderingSettings
source: html/bdb7427e-29f3-b0ba-7a76-d864ba7e9ede.htm
---
# RenderingSettings Methods

Returns an object that represents the rendering background settings.